// Ця функція повинна приймати один параметр query(пошукове слово, яке є рядком),
//   здійснювати HTTP - запит і повертати значення властивості data з отриманої відповіді.

export default function getImagesByQuery(query) {}

// Список параметрів рядка запиту, які тобі обов'язково необхідно вказати:

// key — твій унікальний ключ доступу до API.
// q — слово для пошуку. Те, що буде вводити користувач.
// image_type — тип зображення. Потрібні тільки фотографії, тому постав значення photo.
// orientation — орієнтація фотографії. Постав значення horizontal.
// safesearch — фільтр за віком. Постав значення true.

// У відповіді буде об’єкт із декількома властивостями, в одному з яких(hits) буде масив об’єктів
//  із зображеннями, що задовольнили критерії параметрів запиту.
